spec/fixtures/vcr_cassettes/Invoice/finding_current_billet_url_for_invoice.yml

---
http_interactions:
- request:
    method: post
    uri: http://:AwdhihciTgORGUjnkuk1vg%3D%3D@sandbox.charging.financeconnect.com.br:8080/account/domains/
    body:
      encoding: UTF-8
      string: '{"supplier_name":"Springfield Elemenary School","address":"1608 Florida
        Avenue","city_state":"Greenwood/SC","zipcode":"29646","national_identifier":"03636356092556","description":"The
        mission of Greenwood School District 50 is to educate all students to become
        responsible and productive citizens."}'
    headers:
      Accept:
      - application/json
      Accept-Encoding:
      - gzip, deflate
      Content-Type:
      - application/json
      User-Agent:
      - Charging Ruby Client v0.0.1
      Content-Length:
      - '299'
  response:
    status:
      code: 201
      message: CREATED
    headers:
      Content-Type:
      - text/html; charset=utf-8
      Date:
      - Wed, 16 Oct 2013 16:26:47 GMT
      Link:
      - <http://sandbox.charging.financeconnect.com.br/account/domains/685b2cee-875d-45d8-8754-4539a6b3698b/>;
        rel=domain, <http://sandbox.charging.financeconnect.com.br/account/domains/>;
        rel=domains
      Location:
      - http://sandbox.charging.financeconnect.com.br/account/domains/685b2cee-875d-45d8-8754-4539a6b3698b/
      Server:
      - nginx/1.1.19
      Content-Length:
      - '7'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: CREATED
    http_version: 
  recorded_at: Wed, 16 Oct 2013 16:26:47 GMT
- request:
    method: get
    uri: http://:AwdhihciTgORGUjnkuk1vg%3D%3D@sandbox.charging.financeconnect.com.br:8080/account/domains/685b2cee-875d-45d8-8754-4539a6b3698b/
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - application/json
      Accept-Encoding:
      - gzip, deflate
      Content-Type:
      - application/json
      User-Agent:
      - Charging Ruby Client v0.0.1
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - no-cache
      Content-Type:
      - application/json
      Date:
      - Wed, 16 Oct 2013 16:26:47 GMT
      Etag:
      - '"dc519bd9c2cc7495dbd52eeff8cfe379f7646fae"'
      Expires:
      - Wed, 16 Oct 2013 16:26:46 GMT
      Link:
      - <http://sandbox.charging.financeconnect.com.br/charge-accounts/>; rel=charge_accounts,
        <http://sandbox.charging.financeconnect.com.br/account/domains/>; rel=domains,
        <http://sandbox.charging.financeconnect.com.br/domain/>; rel=domain, <http://sandbox.charging.financeconnect.com.br/account/>;
        rel=service_account
      Server:
      - nginx/1.1.19
      Content-Length:
      - '561'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"uuid": "685b2cee-875d-45d8-8754-4539a6b3698b", "uri": "http://sandbox.charging.financeconnect.com.br/account/domains/685b2cee-875d-45d8-8754-4539a6b3698b/",
        "supplier_name": "Springfield Elemenary School", "zipcode": "29646", "city_state":
        "Greenwood/SC", "token": "lDnUT3qrTIi7BbuPBIsNAQ==", "etag": "dc519bd9c2cc7495dbd52eeff8cfe379f7646fae",
        "national_identifier": "03.636.356/0925-56", "address": "1608 Florida Avenue",
        "description": "The mission of Greenwood School District 50 is to educate
        all students to become responsible and productive citizens."}'
    http_version: 
  recorded_at: Wed, 16 Oct 2013 16:26:48 GMT
- request:
    method: post
    uri: http://:lDnUT3qrTIi7BbuPBIsNAQ%3D%3D@sandbox.charging.financeconnect.com.br:8080/charge-accounts/
    body:
      encoding: UTF-8
      string: '{"account":{"number":"12345","digit":"6"},"agency":{"number":"12345","digit":"6"},"name":"Conta
        de cobrança","portfolio_code":"25","address":null,"zipcode":null,"sequence_numbers":null,"currency":9,"agreement_code":"12345","supplier_name":null,"advance_days":null,"bank":"237","our_number_range":null,"default_charging_features":null,"city_state":null}'
    headers:
      Accept:
      - application/json
      Accept-Encoding:
      - gzip, deflate
      Content-Type:
      - application/json
      User-Agent:
      - Charging Ruby Client v0.0.1
      Content-Length:
      - '353'
  response:
    status:
      code: 201
      message: CREATED
    headers:
      Content-Type:
      - text/html; charset=utf-8
      Date:
      - Wed, 16 Oct 2013 16:26:48 GMT
      Link:
      - <http://sandbox.charging.financeconnect.com.br/charge-accounts/38dbdd9d-f0ab-481b-9349-0d2f92d7939e/>;
        rel=charge_account, <http://sandbox.charging.financeconnect.com.br/charge-accounts/>;
        rel=charge_accounts
      Location:
      - http://sandbox.charging.financeconnect.com.br/charge-accounts/38dbdd9d-f0ab-481b-9349-0d2f92d7939e/
      Server:
      - nginx/1.1.19
      Content-Length:
      - '7'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: CREATED
    http_version: 
  recorded_at: Wed, 16 Oct 2013 16:26:48 GMT
- request:
    method: get
    uri: http://:lDnUT3qrTIi7BbuPBIsNAQ%3D%3D@sandbox.charging.financeconnect.com.br:8080/charge-accounts/38dbdd9d-f0ab-481b-9349-0d2f92d7939e/
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - application/json
      Accept-Encoding:
      - gzip, deflate
      Content-Type:
      - application/json
      User-Agent:
      - Charging Ruby Client v0.0.1
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - no-cache
      Content-Type:
      - application/json
      Date:
      - Wed, 16 Oct 2013 16:26:48 GMT
      Etag:
      - '"414973f5e8d3ecc361435623f65f22f3f675a061"'
      Expires:
      - Wed, 16 Oct 2013 16:26:47 GMT
      Link:
      - <http://sandbox.charging.financeconnect.com.br/charge-accounts/38dbdd9d-f0ab-481b-9349-0d2f92d7939e/batches/>;
        rel=batches, <http://sandbox.charging.financeconnect.com.br/charge-accounts/38dbdd9d-f0ab-481b-9349-0d2f92d7939e/batches/return/>;
        rel=return_files, <http://sandbox.charging.financeconnect.com.br/charge-accounts/38dbdd9d-f0ab-481b-9349-0d2f92d7939e/batches/return/>;
        rel=return_cnab, <http://sandbox.charging.financeconnect.com.br/charge-accounts/38dbdd9d-f0ab-481b-9349-0d2f92d7939e/invoices/>;
        rel=invoices
      Server:
      - nginx/1.1.19
      Content-Length:
      - '737'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"account": {"digit": "6", "number": 12345}, "agency": {"digit": "6",
        "number": 12345}, "name": "Conta de cobran\u00e7a", "etag": "414973f5e8d3ecc361435623f65f22f3f675a061",
        "zipcode": "29646", "portfolio_code": "25", "address": "1608 Florida Avenue",
        "city_state": "Greenwood/SC", "uri": "http://sandbox.charging.financeconnect.com.br/charge-accounts/38dbdd9d-f0ab-481b-9349-0d2f92d7939e/",
        "sequence_numbers": [1, 9999999], "currency": 9, "national_identifier": "03.636.356/0925-56",
        "our_number_range": [1, 99999999999999999999], "agreement_code": "12345",
        "default_charging_features": [1, 2, 1, 2, 2], "supplier_name": "Springfield
        Elemenary School", "advance_days": 10, "bank": "237", "uuid": "38dbdd9d-f0ab-481b-9349-0d2f92d7939e"}'
    http_version: 
  recorded_at: Wed, 16 Oct 2013 16:26:49 GMT
- request:
    method: post
    uri: http://:lDnUT3qrTIi7BbuPBIsNAQ%3D%3D@sandbox.charging.financeconnect.com.br:8080/charge-accounts/38dbdd9d-f0ab-481b-9349-0d2f92d7939e/invoices/
    body:
      encoding: UTF-8
      string: '{"kind":2,"amount":123.45,"document_number":"000000000000001","drawee":{"name":"Nome
        do Sacado","address":"Rua do Carmo, 43","city_state":"Rio de Janeiro/RJ","zipcode":"21345-999","national_identifier":"37.818.380/0001-86"},"due_date":"2020-12-31","portfolio_code":null,"charging_features":null,"supplier_name":null,"discount":null,"interest":null,"rebate":null,"ticket":null,"protest_code":null,"protest_days":null,"instructions":null,"demonstrative":null,"our_number":null}'
    headers:
      Accept:
      - application/json
      Accept-Encoding:
      - gzip, deflate
      Content-Type:
      - application/json
      User-Agent:
      - Charging Ruby Client v0.0.1
      Content-Length:
      - '475'
  response:
    status:
      code: 201
      message: CREATED
    headers:
      Content-Type:
      - text/html; charset=utf-8
      Date:
      - Wed, 16 Oct 2013 16:26:49 GMT
      Link:
      - <http://sandbox.charging.financeconnect.com.br/invoices/ecf0c9a8-f9c5-4c52-991f-b8009f875b54/>;
        rel=invoice, <http://sandbox.charging.financeconnect.com.br/invoices/ecf0c9a8-f9c5-4c52-991f-b8009f875b54/billet/>;
        rel=billet, <http://sandbox.charging.financeconnect.com.br/charge-accounts/38dbdd9d-f0ab-481b-9349-0d2f92d7939e/>;
        rel=charge_account, <http://sandbox.charging.financeconnect.com.br/charge-accounts/38dbdd9d-f0ab-481b-9349-0d2f92d7939e/invoices/>;
        rel=invoices
      Location:
      - http://sandbox.charging.financeconnect.com.br/invoices/ecf0c9a8-f9c5-4c52-991f-b8009f875b54/
      Server:
      - nginx/1.1.19
      Content-Length:
      - '7'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: CREATED
    http_version: 
  recorded_at: Wed, 16 Oct 2013 16:26:50 GMT
- request:
    method: get
    uri: http://:lDnUT3qrTIi7BbuPBIsNAQ%3D%3D@sandbox.charging.financeconnect.com.br:8080/invoices/ecf0c9a8-f9c5-4c52-991f-b8009f875b54/
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - application/json
      Accept-Encoding:
      - gzip, deflate
      Content-Type:
      - application/json
      User-Agent:
      - Charging Ruby Client v0.0.1
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - no-cache
      Content-Type:
      - application/json
      Date:
      - Wed, 16 Oct 2013 16:26:51 GMT
      Etag:
      - '"ff1cf50d515d9b0eee5dd609926fba1cef4efbee"'
      Expires:
      - Wed, 16 Oct 2013 16:26:50 GMT
      Link:
      - <http://sandbox.charging.financeconnect.com.br/invoices/ecf0c9a8-f9c5-4c52-991f-b8009f875b54/billet/>;
        rel=billet
      Server:
      - nginx/1.1.19
      Content-Length:
      - '822'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"due_date": "2020-12-31", "kind": 2, "uuid": "ecf0c9a8-f9c5-4c52-991f-b8009f875b54",
        "drawee": {"name": "Nome do Sacado", "city_state": "Rio de Janeiro / RJ",
        "zipcode": "21345999", "national_identifier": "37.818.380/0001-86", "address":
        "Rua do Carmo, 43", "quarter": ""}, "document_number": "000000000000001",
        "demonstrative": [], "uri": "http://sandbox.charging.financeconnect.com.br/invoices/ecf0c9a8-f9c5-4c52-991f-b8009f875b54/",
        "paid": 0, "charge_account": "http://sandbox.charging.financeconnect.com.br/charge-accounts/38dbdd9d-f0ab-481b-9349-0d2f92d7939e/",
        "discount": null, "amount": "123.45", "interest": {"date": 0, "amount": "0.00",
        "type": 0}, "supplier_name": "Springfield Elemenary School", "document_date":
        "2013-10-16", "charging_features": [1, 2, 1, 2, 2], "portfolio_code": "25",
        "instructions": []}'
    http_version: 
  recorded_at: Wed, 16 Oct 2013 16:26:51 GMT
- request:
    method: get
    uri: http://:lDnUT3qrTIi7BbuPBIsNAQ%3D%3D@sandbox.charging.financeconnect.com.br/charge-accounts/38dbdd9d-f0ab-481b-9349-0d2f92d7939e/
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - application/json
      Accept-Encoding:
      - gzip, deflate
      Content-Type:
      - application/json
      User-Agent:
      - Charging Ruby Client v0.0.1
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - no-cache
      Content-Type:
      - application/json
      Date:
      - Wed, 16 Oct 2013 16:26:51 GMT
      Etag:
      - '"414973f5e8d3ecc361435623f65f22f3f675a061"'
      Expires:
      - Wed, 16 Oct 2013 16:26:50 GMT
      Link:
      - <http://sandbox.charging.financeconnect.com.br/charge-accounts/38dbdd9d-f0ab-481b-9349-0d2f92d7939e/batches/>;
        rel=batches, <http://sandbox.charging.financeconnect.com.br/charge-accounts/38dbdd9d-f0ab-481b-9349-0d2f92d7939e/batches/return/>;
        rel=return_files, <http://sandbox.charging.financeconnect.com.br/charge-accounts/38dbdd9d-f0ab-481b-9349-0d2f92d7939e/batches/return/>;
        rel=return_cnab, <http://sandbox.charging.financeconnect.com.br/charge-accounts/38dbdd9d-f0ab-481b-9349-0d2f92d7939e/invoices/>;
        rel=invoices
      Server:
      - nginx/1.1.19
      Content-Length:
      - '737'
      X-Cache:
      - MISS from firewall.corp.myfreecomm.com.br
      X-Cache-Lookup:
      - MISS from firewall.corp.myfreecomm.com.br:3128
      Via:
      - 1.1 firewall.corp.myfreecomm.com.br:3128 (squid/2.7.STABLE9)
      Connection:
      - close
    body:
      encoding: UTF-8
      string: '{"account": {"digit": "6", "number": 12345}, "agency": {"digit": "6",
        "number": 12345}, "name": "Conta de cobran\u00e7a", "etag": "414973f5e8d3ecc361435623f65f22f3f675a061",
        "zipcode": "29646", "portfolio_code": "25", "address": "1608 Florida Avenue",
        "city_state": "Greenwood/SC", "uri": "http://sandbox.charging.financeconnect.com.br/charge-accounts/38dbdd9d-f0ab-481b-9349-0d2f92d7939e/",
        "sequence_numbers": [1, 9999999], "currency": 9, "national_identifier": "03.636.356/0925-56",
        "our_number_range": [1, 99999999999999999999], "agreement_code": "12345",
        "default_charging_features": [1, 2, 1, 2, 2], "supplier_name": "Springfield
        Elemenary School", "advance_days": 10, "bank": "237", "uuid": "38dbdd9d-f0ab-481b-9349-0d2f92d7939e"}'
    http_version: 
  recorded_at: Wed, 16 Oct 2013 16:26:51 GMT
- request:
    method: get
    uri: http://:lDnUT3qrTIi7BbuPBIsNAQ%3D%3D@sandbox.charging.financeconnect.com.br:8080/invoices/ecf0c9a8-f9c5-4c52-991f-b8009f875b54/billet/
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - application/json
      Accept-Encoding:
      - gzip, deflate
      Content-Type:
      - application/json
      User-Agent:
      - Charging Ruby Client v0.0.1
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - no-cache
      Content-Type:
      - application/json
      Date:
      - Wed, 16 Oct 2013 16:26:52 GMT
      Etag:
      - '"1541de46f44253047d84fac26279a33bb9c5f36b"'
      Expires:
      - Wed, 16 Oct 2013 16:26:51 GMT
      Link:
      - <http://sandbox.charging.financeconnect.com.br/invoices/ecf0c9a8-f9c5-4c52-991f-b8009f875b54/>;
        rel=invoice
      Server:
      - nginx/1.1.19
      Content-Length:
      - '138'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"billet": "http://sandbox.charging.financeconnect.com.br/billets/ecf0c9a8-f9c5-4c52-991f-b8009f875b54/31f396f9a61e407ab58292f917683756/"}'
    http_version: 
  recorded_at: Wed, 16 Oct 2013 16:26:52 GMT
recorded_with: VCR 2.5.0
